1. Detection 1.1 — Successful Logon Event Tracking MITRE Technique: [T1078] Valid Accounts (Track successful logons using EventID 4624 )

index="sim1" sourcetype="cvs" source="SecurityLogs_MITRE_Advanced_sample.csv" EventID=4624
| stats count by Account_Name, ComputerName, Source_IP, LogonType
| sort - count


2. Detection 1.2 – Multiple Failed Logon Attempts by Single Source IP MITRE Technique: [T1110] Brute Force Goal: Detect brute-force attacks from a single source IP attempting multiple logins.

index="sim1" sourcetype="cvs" source="SecurityLogs_MITRE_Advanced_sample.csv"
EventID=4625
| stats count by Source_IP, Account_Name
| where count >= 5
| sort - count

3. Detection 1.3 — Successful Logon After Multiple Failures MITRE Technique: [T1110] Brute Force → Credential Access Goal: Detect cases where a user had multiple failed logon attempts followed by a successful one — indicating possible password guessing success.

index="sim1" sourcetype="cvs" source="SecurityLogs_MITRE_Advanced_sample.csv"
(EventID=4625 OR EventID=4624)
| stats values(EventID) as event_list count(eval(EventID=4625)) as failed_attempts,
        count(eval(EventID=4624)) as success_count by Account_Name, Source_IP
| where failed_attempts >= 3 AND success_count >= 1

4. Detection 1.4 — Privileged Logon Detection MITRE Technique: [T1078.002] Valid Accounts: Domain Accounts Goal: Detect logon events where privileged (admin-level) accounts are used — especially if unexpected.

index="sim1" sourcetype="cvs" source="SecurityLogs_MITRE_Advanced_sample.csv"
EventID=4624 AND ElevatedPrivileges="Yes"
| stats count by Account_Name, Source_IP, ComputerName, LogonType


